package com.apashart.lesson5

//Оператор элвиса
//
//Задание выполняется в виде функций, принимающих один или более аргументов.
// Все функции должны быть вызваны из функции main() в вариантах с null и с вещественным значением.

//======
//
//Контекст: Вы изучаете физическое явление затухания звука в помещении.
// У вас есть измеренное значение начальной интенсивности звука,
// но из-за ограничений оборудования данные о коэффициенте затухания иногда могут быть неизвестны.
//Задача: Рассчитать предполагаемую интенсивность звука после затухания.
// Интенсивность звука после затухания пропорциональна начальной интенсивности, умноженной на коэффициент затухания.
// Если коэффициент затухания неизвестен, использовать стандартное значение 0.5.

fun main () {
    meterSound(15,2.0)
    meterSound(15,null)
    diliveryFullCost(100,100.0)
    diliveryFullCost(null,100.0)
    weatherMeter(8.3)
    weatherMeter(null)
}
fun meterSound (startNoise: Int, k: Double?) {
    val defoltK = 0.5 //дефолтный коэфицент
    var levelSound = startNoise * (k ?: defoltK)
    println("Уровень звука: $levelSound")
}
// ======
//
// Контекст: Клиент оплачивает доставку груза.
// К стоимости доставки добавляется страховка на груз, которая составляет 0,5% от его стоимости.
// В случае, если стоимость не указана, то берётся стандартная стоимость в $50
//Задача: Рассчитать полную стоимость доставки.

fun diliveryFullCost (cargoPrice: Int?, diliveryPrice: Double) {
    val defoltInsurancePrice = 50
    var insurancePrice = (cargoPrice ?: defoltInsurancePrice) * 0.005
    println("Стоимость груза: " + (insurancePrice + diliveryPrice))
}

// =====
//
//Контекст: Вы проводите метеорологические измерения. Одним из важных показателей является атмосферное давление, которое должно быть зафиксировано.
// Лаборант приносит вам набор показателей, но по пути может что-нибудь потерять.
// Задача: сообщить об ошибке в случае отсутствия показаний атмосферного давления.

fun weatherMeter (atmosphericPressure: Double?) {
    atmosphericPressure ?: throw Exception("Лаборант мудак, потерял показания")
}